module.exports = {
    sections: {
        title: 'Категорії',
        account: {
            block_name: 'Сторінка',
            methods: {
                clear_stickers: 'Очищення стікерів',
                id: 'Дізнатися ID сторінки'
            }
        },
        contacts: {
            block_name: 'Контакти',
            methods: { analysis: 'Аналіз контактів' }
        },
        dialogs: {
            block_name: 'Повідомлення',
            methods: {
                admins: 'Керовані чати та канали',
                messages_stat: 'Статистика повідомлень',
                read: 'Прочитати діалоги',
                top_channels: 'Топ чатів і каналів'
            }
        }
    },
    auth: {
        description: 'Kit 42 - продукт з багатьма функціями для Telegram. Для роботи продукту потрібно авторизуватися у свій обліковий запис Telegram.',
        input_number: 'Номер телефону',
        input_code: 'Код для авторизації',
        input_password: '2FA пароль',
        button_number: 'Надіслати код',
        button_code: 'Підтвердити',
        button_password: 'Увійти',
        not_registered: 'Аккаунт з таким номером не знайдений'
    },
    app: {
        cancel: 'Відміна',
        back: 'Назад',
        loading: 'Секундочку',
        loading_dialogs: 'Отримую діалоги',
        finish: 'Готово',
        error: 'Помилка',
        wait_error: 'Занадто багато запитів до API, потрібно почекати {time}',
        lang: 'Мова',
        alpha: {
            title: 'Альфа-версія',
            description: 'Це альфа-версія продукту, в ній можуть бути помилки і недоробки. Якщо ви знайшли помилку або у вас є пропозиція, будь ласка, напишіть про це розробнику в особисті повідомлення. Функції будуть додаватися по ходу життя продукту!',
            button_dev: 'Розробник'
        },
        wait_error_seconds: [
            'секунду',
            'секунди',
            'секунд'
        ],
        time_decline: {
            days: [
                'доба',
                'діб',
                'діб'
            ],
            hours: [
                'година',
                'години',
                'годин'
            ],
            minutes: [
                'хвилина',
                'хвилини',
                'хвилин'
            ],
            seconds: [
                'секунду',
                'секунди',
                'секунд'
            ]
        }
    },
    profile: {
        title: 'Профіль',
        logout: 'Вийти',
        theme: {
            title: 'Тема оформлення',
            light: 'Світла',
            dark: 'Темна'
        }
    },
    MTProtoErrors: {
        PHONE_NUMBER_INVALID: 'Невірний номер телефону',
        PHONE_CODE_INVALID: 'Некоректний код',
        PASSWORD_HASH_INVALID: 'Некоректний пароль',
        CHANNEL_PRIVATE: 'Ви ще не приєдналися до цього каналу / супергрупи',
        MSG_ID_INVALID: 'Вказаний ідентифікатор повідомлення неправильний',
        USER_ID_INVALID: 'Вказаний ідентифікатор користувача недійсний',
        CHANNEL_INVALID: 'Зазначений канал недійсний',
        FILE_REFERENCE_: 'Термін дії посилання на файл закінчився, її необхідно оновити',
        FILEREF_UPGRADE_NEEDED: 'Клієнт повинен бути оновлений, щоб підтримувати посилання на файли',
        FILE_ID_INVALID: 'Вказаний ідентифікатор файлу недійсний',
        FILE_REFERENCE_EXPIRED: 'Термін дії посилання на файл закінчився, її необхідно повторно завантажити, як описано в документації',
        LIMIT_INVALID: 'Зазначений ліміт недійсний',
        LOCATION_INVALID: 'Зазначене місце розташування є недійсним',
        OFFSET_INVALID: 'Зазначене зміщення є неприпустимим',
        PEER_ID_INVALID: 'Вказаний ідентифікатор вузла недійсний',
        API_ID_INVALID: 'Недійсний ідентифікатор API',
        API_ID_PUBLISHED_FLOOD: 'Цей ідентифікатор API був десь опублікований, ви не можете використовувати його зараз',
        AUTH_RESTART: 'Перезапустіть процес авторизації',
        PHONE_NUMBER_APP_SIGNUP_FORBIDDEN: 'Ви не можете зареєструватися за допомогою цього додатка',
        PHONE_NUMBER_BANNED: 'Вказаний номер телефону заблокований в telegram',
        PHONE_NUMBER_FLOOD: 'Ви занадто багато разів запитували код',
        PHONE_PASSWORD_FLOOD: 'Ви намагалися увійти в систему занадто багато разів',
        PHONE_PASSWORD_PROTECTED: 'Цей телефон захищений паролем',
        SMS_CODE_CREATE_FAILED: 'Сталася помилка при створенні SMS-коду',
        PHONE_CODE_EMPTY: 'Телефонний код відсутній',
        PHONE_CODE_EXPIRED: 'Термін дії наданого вами телефонного коду закінчився',
        PHONE_NUMBER_UNOCCUPIED: 'Номер телефону ще не використовується',
        SIGN_IN_FAILED: 'Збій при вході в систему',
        SRP_ID_INVALID: 'Наданий неправильний ідентифікатор SRP',
        SRP_PASSWORD_CHANGED: 'Пароль змінений',
        CONNECTION_LAYER_INVALID: 'Помилка з\'єднання',
        USERNAME_INVALID: 'Вказане ім\'я користувача недійсне',
        USERNAME_NOT_OCCUPIED: 'Вказане ім\'я користувача не зайнято',
        STICKERSET_INVALID: 'Наданий набір стікерів недійсний.'
    },
    MultiProgress: { empty_total: 'Рахуємо' },
    methods: {
        account_id: {
            button_get: 'Отримати ID',
            unknown_owner: 'Не змогли визначити сторінку'
        },
        account_clear_stickers: {
            stickers: 'Додано стікерпаків',
            clear_stickers: 'Видалити стікери',
            not_found: 'Не знайдено доданих стікерів'
        },
        contacts_analysis: {
            show_all_users: 'Показати всіх',
            not_found: 'Не знайдено контактів',
            headers: {
                premium: 'Є підписка Telegram Premium',
                old: 'Зареєструвалися в перших 100 мільйонах користувачів',
                mutual: 'В контактах один у одного',
                non_mutual: 'Невзаємні контакти',
                without_photo: 'Без фото',
                verified: 'Верифіковані',
                without_phone: 'Невірний номер телефону',
                without_username: 'Без адреси сторінки',
                deleted: 'Видалений',
                long_time_online: 'Давно не були онлайн',
                hide_online: 'Приховали свій онлайн',
                recent_online: 'За часом останнього онлайну'
            }
        },
        dialogs_admins: {
            no_admins: 'Не знайшли чатів або каналів які адмініструються вами',
            creator: 'Створювач',
            admin: 'Адміністратор'
        },
        dialogs_messages_stat: {
            no_messages: 'В діалозі немає повідомлень',
            too_few_messages: 'Для статистики потрібно більше повідомлень',
            get_messages: 'Отримання повідомлень',
            stat_date: 'Статистика за {date}',
            tops: {
                count: 'Повідомлення',
                uniq_count: 'Унікальні повідомлення',
                emoji: 'Преміум емодзі',
                attachments: 'Вкладення',
                stickers: 'Стікери',
                voice_duration: 'Голосові повідомлення',
                round_duration: 'Відеоповідомлення'
            },
            uniq_description: 'Кілька повідомлень поспіль, не розділені іншими співрозмовниками, будуть вважатися унікальними',
            total_descriptions: {
                voice: 'Тривалість голосових повідомлень',
                round: 'Тривалість відеоповідомлень',
                calls: 'Тривалість дзвінків'
            },
            not_counted: 'Не змогли визначити період',
            periods_header: 'Період статистики',
            periods: {
                1: 'Доба',
                3: '3 доби',
                7: 'Тиждень',
                14: '2 тижні',
                30: 'Місяць',
                90: 'Квартал',
                180: 'Півроку',
                365: 'Рік',
                all: 'Весь діалог'
            },
            decline: {
                count: [
                    'повідомлення',
                    'повідомлення',
                    'повідомлень'
                ],
                uniq_count: [
                    'унікальне повідомлення',
                    'унікальних повідомлення',
                    'унікальних повідомлень'
                ],
                emoji: [
                    'преміум емодзі',
                    'преміум емодзі',
                    'преміум емодзі'
                ],
                attachments: [
                    'вкладення',
                    'вкладення',
                    'вкладень'
                ],
                stickers: [
                    'стікер',
                    'стікери',
                    'стікерів'
                ]
            }
        },
        dialogs_read: {
            no_dialogs: 'Немає непрочитаних діалогів',
            dialogs: 'Непрочитаних діалогів',
            read_dialogs: 'Прочитати діалоги'
        },
        dialogs_top_channels: {
            tab_users: 'Користувачі',
            tab_chats: 'Чати',
            tab_channels: 'Канали',
            no_dialogs: 'Немає діалогів',
            messages: [
                'повідомлення',
                'повідомлення',
                'повідомлень'
            ],
            members: [
                'учасник',
                'учасники',
                'учасників '
            ]
        }
    }
};